app/Helpers/custom_helper.php

SELECT *
FROM `companies`
WHERE `id` = 1
 LIMIT 1
---
    function company_info($id = "",$column = "")
    {
        if($id == "") {
            $id = static_company_id();
        }
        $model = new CompanyModel();
        if($column == "") {
            $company = $model->where('id',$id)->first();

SELECT `id`, `name`, `avatar`, `created_at`
FROM `service_groups`
WHERE `id` IN ('1','2','3','4','5','7','8','9','10','12','13','14','37','39')
AND `is_active` = 1
AND `is_deleted` = 0
ORDER BY `position` ASC
---
    function get_service_groups($company_id = 1)
    {
        $ids = array();
        $model = new CompanyModel;
        $group = $model->select("company_service_groups")->where("id",$company_id)->first();
        if(!empty($group)) {
            $ids = explode(",",$group["company_service_groups"]);
        }
        if(!empty($ids)) {
            $model = new ServiceModel();
            $services = $model->select('id,name,avatar,created_at')->whereIn('id',$ids)->where(array("is_active" => 1,"is_deleted" => 0))->orderBy("position","asc")->get()->getResultArray();

SELECT `id`, `name`, `discount_type`, `discount_value`
FROM `discount_types`
WHERE `is_active` = '1'
AND `company_id` = 1
ORDER BY `position` ASC
---
    function getDiscountList($company_id)
    {
        $model = new DiscountTypeModel();
        $discount_types = $model->select("id,name,discount_type,discount_value")->where("is_active",'1')->where("company_id",$company_id)->orderBy("position","asc")->get()->getResultArray();

SELECT `id`, `name`
FROM `payment_types`
WHERE `is_active` = '1'
AND `is_deleted` = 0
AND `company_id` = 1
ORDER BY `position` ASC
---
    function getPaymentList($company_id)
    {
        $model = new PaymentTypeModel();
        $payment_types = $model->select("id,name")->where("is_active",'1')->where('is_deleted',0)->where("company_id",$company_id)->orderBy("position","asc")->get()->getResultArray();