app/Controllers/Api.php

SELECT `r`.*, `c`.`name`
FROM `reviews` `r`
JOIN `customers` `c` ON `c`.`id`=`r`.`given_by`
WHERE `company_id` = '2'
AND `is_approved` = 1
AND `r`.`deleted_at` Is NULL
ORDER BY `r`.`id` DESC
---
        public function our_reviews()
        {
            $post = $this->request->getVar();
            $input_parameter = array('key','tag','company_id');
            $validation = ParamValidation($input_parameter, $post);

            if($validation[RESPONSE_STATUS] == RESPONSE_FLAG_FAIL)
            {
                return $this->respond($validation);
            } else if($post['key'] != APP_KEY || $post['tag'] != "our_reviews") {
                $response[RESPONSE_STATUS] = RESPONSE_FLAG_FAIL;
                $response[RESPONSE_MESSAGE] = RESPONSE_INVALID_KEY;
                return $this->respond($response);
            } else {
                $db = db_connect();
                $res = $db->table('reviews r');
                $res = $res->select("r.*,c.name");
                $res = $res->join("customers c","c.id=r.given_by");
                $res = $res->where(["company_id" => $post["company_id"],"is_approved" => 1]);
                $res = $res->where("r.deleted_at Is NULL");
                $res = $res->orderBy("r.id","desc");
                $reviews = $res->get()->getResultArray();