app/Controllers/Dashboard.php

        public function drop_appointment()
        {
            $post = $this->request->getVar();

            $model = new CartModel;
            $_cart = $model->select("appointmentId,staffId,message")->where("id",$post["cart_id"])->first();
            if($_cart) {
                $model = new AppointmentModel;
                $count = $model->where("id",$_cart["appointmentId"])->where("status",1)->get()->getNumRows();
                if($count > 0) {
                    $message = "";
                    $color = "#000000";
                    $model = new Staff;
                    $staff = $model->select("fname,lname,color")->where("id",$post["staff_id"])->first();
                    if(!empty($staff)) {
                        $color = $staff["color"];
                    }

                    $message = $_cart["message"];
                    $model = new Staff;
                    $old_staff = $model->select("fname,lname")->where("id",$_cart["staffId"])->first();
                    if(!empty($old_staff)) {
                        $message = str_replace($old_staff["fname"]." ".$old_staff["lname"],$staff["fname"]." ".$staff["lname"],$_cart["message"]);
                    }
                    $model = new CartModel;
                    $model->update($post["cart_id"],array("message" => $message,"staffId" => $post["staff_id"],"color" => $color,"stime" => $post["new_stime"].":00","etime" => $post["new_etime"].":00"));

                    $model = new EntryModel;
                    $model->where("cart_id",$post["cart_id"])->set(array("staff_id" => $post["staff_id"],"stime" => $post["new_stime"].":00","etime" => $post["new_etime"].":00"))->update();
---
UPDATE `carts` SET `message` = '07400625783 - Lucinda shing\nEyebrow -\nThreading\nRutva -', `staffId` = '35', `color` = '#8b4263', `stime` = '11:50:00', `etime` = '11:57:00'
WHERE `carts`.`id` IN ('141939')
UPDATE `entries` SET `staff_id` = '35', `stime` = '11:50:00', `etime` = '11:57:00'
WHERE `cart_id` = '141939'

        public function get_available_staff_time()
        {
            $date = $this->request->getVar('date');
            $date = date("Y-m-d",strtotime($date));
            $response = [];

            $db = db_connect();
            $staff = $db->table('staffs s');
            $staff->select("DISTINCT(s.id),CONCAT_WS(' ',s.fname,s.lname) AS title,s.color,st.stime,st.etime");
            $staff->join("staff_timings st","s.id=st.staffId");
            $staff->where('st.date',$date);
            $staff->where(['s.user_type' => 1,"s.is_active" => 1,"s.is_deleted" => 0]);
            $staff->where('st.companyId',static_company_id());
            $staffs = $staff->get()->getResultArray();
---
SELECT DISTINCT(s.id), CONCAT_WS(' ', `s`.`fname`, s.lname) AS title, `s`.`color`, `st`.`stime`, `st`.`etime`
FROM `staffs` `s`
JOIN `staff_timings` `st` ON `s`.`id`=`st`.`staffId`
WHERE `st`.`date` = '2025-09-12'
AND `s`.`user_type` = 1
AND `s`.`is_active` = 1
AND `s`.`is_deleted` = 0
AND `st`.`companyId` = 1