app/Controllers/Staff_timings.php

SELECT `id`, `date`, `stime`, `etime`, `isRepeat`
FROM `staff_timings`
WHERE `staffId` = '27'
AND `companyId` = 1
AND `date` = '2025-09-08'
 LIMIT 1
---
        public function get_timing_grid()
        {
            $session = session();
            $post = $this->request->getVar();

            $sign = $post['sign'] == "next" ? "+" : "-";
            if($post['addDay'] == 1)
                $sdate = $post['sdate'] == "" ? date('Y-m-d',strtotime("this week")) : $post['sdate'];
            else
                $sdate = $post['sdate'] == "" ? date('Y-m-d', strtotime("this week")) : date("Y-m-d",strtotime($post['sdate']."".$sign."1 day"));

            $tdate = $sdate;
            $edate = date("Y-m-d",strtotime($sdate."".$sign."6 days"));
            if($sign == "-")
            {
                $sdate = $edate;
                $edate = $tdate;
            }
            $model = new Staff;
            // $staffs = $model->where("user_type !=",0)->where('is_active','1')->where("company_id",static_company_id())->get()->getResultArray();
            $staffs = $model->where("user_type !=",0)->where('is_active','1')->where('is_deleted',0)->get()->getResultArray();
            $timing_arr = getDatesFromRange($sdate,$edate);
            if($staffs)
            {
                $model = new StaffTimingModel();
                foreach($staffs as $key => $val)
                {
                    $dates = $times = array();
                    foreach($timing_arr as $k => $v)
                    {
                        $timing = $model->select("id,date,stime,etime,isRepeat")->where('staffId',$val['id'])->where("companyId",static_company_id())->where("date",$v)->first();